//此文件为课表各科格式的记录,格式类似如下
/**
 * 
 * o = {
 *      major : "computer",
 *      "11月27日周一" : "",
 * }
 * 
 */



 //此为11月27后的课程
const computer = {
    major : "computer",
    "11月27日周一" : ",,",
    "11月28日周二" : ",,",
    "11月29日周三" : "英语,高数,高数",
    "11月30日周四" : "操作系统,操作系统,",
    "12月1日周五" : "英语,高数,高数",
    "12月2日周六" : ",英语,",
    "12月3日周日" : "高数,高数,英语",
}

const management = {
    major : "management",
    "11月27日周一" : ",,",
    "11月28日周二" : ",,管理学",
    "11月29日周三" : "英语,,",
    "11月30日周四" : "计算机,计算机,",
    "12月1日周五" : "英语,,",
    "12月2日周六" : "管理学,英语,",
    "12月3日周日" : ",,英语",
}

const civilengineering = {
    major : "civilengineering",
    "11月27日周一" : ",,",
    "11月28日周二" : ",,",
    "11月29日周三" : "英语,,",
    "11月30日周四" : "计算机,计算机,",
    "12月1日周五" : "英语,,",
    "12月2日周六" : ",英语,",
    "12月3日周日" : "高数,高数,英语",
}

const majors = {
    "computer" : computer,
    "management" : management,
    "civilengineering" : civilengineering
}